<h1>#13 Konversi nilai numerik ke dalam sejumlah kategori

In [1]:
#Import Modules
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

<h3> Persiapan Data Frame

In [4]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1,99, size=(n_rows,n_cols)),
                  columns=cols)
df

   usia
0    52
1    30
2    28
3    84
4    40
5    21
6    39
7    52
8    57
9    49

<h3> Pengelompokan nilai numerik ke dalam beberapa kategori menggunakan cut()

In [6]:
df['kelompok_usia'] = pd.cut(df['usia'],
                             bins = [0, 18, 65, 99],
                             labels = ['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    52        dewasa
1    30        dewasa
2    28        dewasa
3    84        manula
4    40        dewasa
5    21        dewasa
6    39        dewasa
7    52        dewasa
8    57        dewasa
9    49        dewasa

<h1>#14 Menggabungkan (merge) dua Data Frame

In [7]:
#Import Modules 
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

<h3> Persiapan Data Frame

In [8]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols)

df.head()

    A   B   C   D   E
0  16   1   3   4  17
1  18   3   8   6   1
2  14   9   8  19   7
3   4  13  15  15  13
4  14   4  11  13  12

In [9]:
df1 = df.copy(deep = True)
df1 = df1.drop([1,4])
df1

    A   B   C   D   E
0  16   1   3   4  17
2  14   9   8  19   7
3   4  13  15  15  13

In [11]:
df2 = df.copy(deep = True)
df2 = df2.drop([0,3])
df2

    A  B   C   D   E
1  18  3   8   6   1
2  14  9   8  19   7
4  14  4  11  13  12

<h3> Menggabungkan 2 Data Frame

In [12]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

    A  B  C   D  E
0  14  9  8  19  7

In [13]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    A   B   C   D   E
0  16   1   3   4  17
1  14   9   8  19   7
2   4  13  15  15  13
3  18   3   8   6   1
4  14   4  11  13  12

<h1>#15 Memecah nilai string dari suatu kolom ke dalam beberapa kolom baru

In [14]:
#import pandas as pd

print(pd.__version__)

1.3.3

<h3> Persiapan Data Frame

In [17]:
data ={'nama':['Didi Kempot', 'Glen Fredly', 'Mbah Surip'],
       'tempat_kelahiran':['Surakarta,Jawa Tengah','Jakarta, DKI Jakarta','Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

          nama       tempat_kelahiran
0  Didi Kempot  Surakarta,Jawa Tengah
1  Glen Fredly   Jakarta, DKI Jakarta
2   Mbah Surip  Mojokerto, Jawa Timur

<h3> Memecah nama depan & nama belakang

In [18]:
df[['nama_depan','nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

          nama       tempat_kelahiran nama_depan nama_belakang
0  Didi Kempot  Surakarta,Jawa Tengah       Didi        Kempot
1  Glen Fredly   Jakarta, DKI Jakarta       Glen        Fredly
2   Mbah Surip  Mojokerto, Jawa Timur       Mbah         Surip

<h3> Memecah nama kota & provinsi

In [19]:
df[['kota', 'provinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,provinsi
0,Didi Kempot,"Surakarta,Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glen Fredly,"Jakarta, DKI Jakarta",Glen,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur

<h1>#16 Menata ulang Data Frame dengan multiple indexes menggunakan unstack()

In [20]:
#Import Modules
import pandas as pd

print(pd.__version__)

1.3.3

<h3> Persiapan Data Frame

In [22]:
df = pd.read_csv('F:/Jessica/Downloads/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

<h3> Data Frame dengan multiple indexes dari hasil grouping

In [23]:
df.groupby(['sex','pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

<h3> Menata ulang Data Frame dengan multiple indexes

In [24]:
df.groupby(['sex', 'pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130